Documents/Разукомплектация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Разукомплектация</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладИсточник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПриемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураИсточник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаНоменклатурыИсточника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияНоменклатурыИсточника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоИсточника</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмеренияИсточника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентИсточника</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоляСтоимости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/Разукомплектация/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработкаСобытий
	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
		
	ОбщаяДоляСтоимости = Товары.Итог("ДоляСтоимости");
	Если НЕ ОбщаяДоляСтоимости = 100 Тогда
		Сообщить("Доля стоимости всех получаемых товаров должна составлять 100%. В документе указано " + ОбщаяДоляСтоимости + "%");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	//регистр ТоварыНаСкладах Расход Источника
	ТаблицаНоменклатур = Новый ТаблицаЗначений;
	ТаблицаНоменклатур.Колонки.Добавить("Номенклатура");
	ТаблицаНоменклатур.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ТаблицаНоменклатур.Колонки.Добавить("СерияНоменклатуры");
	ТаблицаНоменклатур.Колонки.Добавить("Количество");
	ТаблицаНоменклатур.Колонки.Добавить("Коэффициент");
	
	НоваяСтрока = ТаблицаНоменклатур.Добавить();
	НоваяСтрока.Номенклатура = НоменклатураИсточник;
	НоваяСтрока.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатурыИсточника;
	НоваяСтрока.СерияНоменклатуры = СерияНоменклатурыИсточника;
	НоваяСтрока.Количество = КоличествоИсточника;
	НоваяСтрока.Коэффициент = КоэффициентИсточника;
	
	//++ №8793 нужно свернуть, чтобы корректно списать себестоимость
	ТаблицаНоменклатур.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, Коэффициент", "Количество"); 
	//-- №8793
	
	ОрганизацияТоваров = Организация;
	Если Константы.ОбщиеСклады.Получить() Тогда
		ОрганизацияТоваров = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	ДатаДвижения = Дата;
	Если ДатаДвижения = Дата(1,1,1) Тогда
		ДатаДвижения = ТекущаяДатаСеанса();
	КонецЕсли;
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Отказ = НЕ Движения.ТоварыНаСкладах.КонтрольОстатков(Ссылка, ОрганизацияТоваров, СкладИсточник, ТаблицаНоменклатур, ДатаДвижения);
	Если Отказ Тогда
		Возврат;
	Иначе
		Для Каждого Товар Из ТаблицаНоменклатур Цикл
			Расход = Движения.ТоварыНаСкладах.Добавить();
			Расход.ВидДвижения = ВидДвиженияНакопления.Расход;
			Расход.Период = ДатаДвижения;
			Расход.Организация = ОрганизацияТоваров;
			Расход.Склад = СкладИсточник;
			Расход.Номенклатура = Товар.Номенклатура;
			Расход.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
			Расход.СерияНоменклатуры = Товар.СерияНоменклатуры;
			Расход.Количество = Товар.Количество * Товар.Коэффициент;
			//#8288
			//Расход.Сумма = Расход.Количество * Движения.ТоварыНаСкладах.ПолучитьЦенуОстаткаНоменклатуры(ДатаДвижения, ОрганизацияТоваров, СкладИсточник, Расход.Номенклатура, Расход.ХарактеристикаНоменклатуры, Расход.СерияНоменклатуры);
			СтруктураЦенОстатков = Движения.ТоварыНаСкладах.ПолучитьЦеныОстаткаНоменклатуры(ДатаДвижения, ОрганизацияТоваров, СкладИсточник, Расход.Номенклатура, Расход.ХарактеристикаНоменклатуры, Расход.СерияНоменклатуры);
			Расход.Сумма = Расход.Количество * СтруктураЦенОстатков.Цена;
			Расход.СуммаВал = Расход.Количество * СтруктураЦенОстатков.ЦенаВал;
		КонецЦикла;
	КонецЕсли;
	
	//приход товаров-приемников
	ОбщаяСтоимостьСписания = Движения.ТоварыНаСкладах.ПолучитьЦенуОстаткаНоменклатуры(Дата, ОрганизацияТоваров, СкладИсточник, НоменклатураИсточник, ХарактеристикаНоменклатурыИсточника, СерияНоменклатурыИсточника);
	ОбщаяСтоимостьСписания = ОбщаяСтоимостьСписания * КоличествоИсточника * КоэффициентИсточника;
	
	ТаблицаНоменклатур = Новый ТаблицаЗначений;
	ТаблицаНоменклатур.Очистить();
	ТаблицаНоменклатур.Колонки.Добавить("Номенклатура");
	ТаблицаНоменклатур.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ТаблицаНоменклатур.Колонки.Добавить("СерияНоменклатуры");
	ТаблицаНоменклатур.Колонки.Добавить("Количество");
	ТаблицаНоменклатур.Колонки.Добавить("Коэффициент");
	ТаблицаНоменклатур.Колонки.Добавить("Сумма");
	ТаблицаНоменклатур.Колонки.Добавить("ДоляСтоимости");
	
	Для Каждого ТекущаяСтрока Из Товары Цикл
		НоваяСтрока = ТаблицаНоменклатур.Добавить();
		НоваяСтрока.Номенклатура = ТекущаяСтрока.Номенклатура;
		НоваяСтрока.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
		НоваяСтрока.СерияНоменклатуры = ТекущаяСтрока.СерияНоменклатуры;
		НоваяСтрока.Количество = ТекущаяСтрока.Количество;
		НоваяСтрока.Коэффициент = ТекущаяСтрока.Коэффициент;
		НоваяСтрока.ДоляСтоимости = ТекущаяСтрока.ДоляСтоимости;
		НоваяСтрока.Сумма = (ТекущаяСтрока.ДоляСтоимости / 100) * ОбщаяСтоимостьСписания;
	КонецЦикла;
	
	Если НЕ ОбщаяСтоимостьСписания = ТаблицаНоменклатур.Итог("Сумма") Тогда
		ТаблицаНоменклатур[ТаблицаНоменклатур.Количество()].Сумма = ТаблицаНоменклатур[ТаблицаНоменклатур.Количество()].Сумма + (ОбщаяСтоимостьСписания - ТаблицаНоменклатур.Итог("Сумма"))
	КонецЕсли;
	
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Для Каждого Товар Из ТаблицаНоменклатур Цикл
		Приход = Движения.ТоварыНаСкладах.Добавить();
		Приход.ВидДвижения = ВидДвиженияНакопления.Приход;
		Приход.Период = Дата;
		Приход.Организация = ОрганизацияТоваров;
		Приход.Склад = СкладПриемник;
		Приход.Номенклатура = Товар.Номенклатура;
		Приход.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;
		Приход.СерияНоменклатуры = Товар.СерияНоменклатуры;
		Приход.Количество = Товар.Количество * Товар.Коэффициент;
		Приход.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, Товар.Сумма);
		Приход.СуммаВал = РаботаСВалютой.ПолучитьСуммуВДопВалютеУчетаПоДокументу(Ссылка, Товар.Сумма); //#8288
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
